Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum
The weld NDT inspection level.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_NONE
No NDT inspection level.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_A
The NDT inspection level A.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_B
The NDT inspection level B.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_C
The NDT inspection level C.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_D
The NDT inspection level D.

Tekla.Structures.Model.BaseWeld.WeldNDTInspectionEnum.WELD_NDT_INSPECTION_E
The NDT inspection level E.